Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name[quarkus.kogito.devservices.service-name]` [.description] -- The value of the `kogito-dev-service-data-index` label attached to the started container. This property is used when shared is set to true. In this case, before starting a container, Dev Services for Kogito looks for a container with the `kogito-dev-service-data-index` label set to the configured value. If found, it will use this container instead of starting a new one. Otherwise, it starts a new container with the `kogito-dev-service-data-index` label set to the specified value. This property is used when you need multiple shared Data Index instances. --
ja_jp: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.service-name[quarkus.kogito.devservices.service-name]` [.description] -- 起動したコンテナに設定されている `kogito-dev-service-data-index` ラベルの値。このプロパティはsharedプロパティがtrueに設定されているときに使用されます。この場合、コンテナを起動する前に、Dev Services for Kogito は `kogito-dev-service-data-index` ラベルに設定された値を持つコンテナを探します。見つかった場合は、新しいコンテナを起動する代わりにこのコンテナを使用します。そうでない場合は `kogito-dev-service-data-index` ラベルに設定された値を持つ新しいコンテナを開始します。このプロパティは、複数の共有データインデックスインスタンスが必要な場合に使用します。 --

source: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Indicates if the Data Index instance managed by Quarkus Dev Services is shared. When shared, Quarkus looks for running containers using label-based service discovery. If a matching container is found, it is used, and so a second one is not started. Otherwise, Dev Services for Kogito starts a new container. The discovery uses the `kogito-dev-service-data-index` label. The value is configured using the service-name property. Container sharing is only used in dev mode. --
ja_jp: icon:lock[title=Fixed at build time] [[quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared]]`link:#quarkus-kogito-dev-services-build-time-config_quarkus.kogito.devservices.shared[quarkus.kogito.devservices.shared]` [.description] -- Quarkus Dev Services によって管理されるデータインデックスインスタンスが共有されているかどうかを示します。共有されている場合、Quarkusはラベルベースのサービス検出を使用して、実行中のコンテナを検索します。一致するコンテナが見つかった場合、そのコンテナが使用されるため、2つ目のコンテナは起動されません。そうでない場合は、Dev Services for Kogito が新しいコンテナを起動します。ディスカバリーは `kogito-dev-service-data-index` ラベルを使用します。この値は service-name プロパティで設定します。コンテナの共有は、Dev モードでのみ使用されます。 --

source: if ID token is required
ja_jp: ID トークンが必須かどうか

source: if Java Script auto redirect is required
ja_jp: JavaScript オートリダイレクトが必要かどうか

source: if `io.quarkus.oidc.UserInfo` injection point is detected but only if the current OIDC tenant supports a UserInfo endpoint.
ja_jp: `io.quarkus.oidc.UserInfo` インジェクションポイントが検出された場合。ただし、有効になるのは、現在の OIDC テナントが UserInfo エンドポイントをサポートしている場合だけです。

source: if `io.quarkus.oidc.UserInfo` injection point is detected, but only if the current OIDC tenant supports a UserInfo endpoint.
ja_jp: `io.quarkus.oidc.UserInfo` インジェクションポイントが検出された場合。ただし、有効になるのは、現在の OIDC テナントが UserInfo エンドポイントをサポートしている場合のみです。

source: if `quarkus.oidc.roles.source` is set to `userinfo` or `quarkus.oidc.token.verify-access-token-with-user-info` is set to `true` or `quarkus.oidc.authentication.id-token-required` is set to `false`, the current OIDC tenant must support a UserInfo endpoint in these cases.
ja_jp: `quarkus.oidc.roles.source` が `userinfo` に設定されている場合、または `quarkus.oidc.token.verify-access-token-with-user-info` が `true` に設定されている場合、または `quarkus.oidc.authentication.id-token-required` が `false` に設定されている場合。このような場合、現在の OIDC テナントが UserInfo エンドポイントをサポートしている必要があります。

source: if a reply handler is set then the failure is propagated back to the sender via an `io.vertx.core.eventbus.ReplyException` with code `ConsumeEvent#FAILURE_CODE` and the exception message,
ja_jp: 返信ハンドラーが設定されている場合、失敗はコード `ConsumeEvent#FAILURE_CODE` と例外メッセージを含んだ `io.vertx.core.eventbus.ReplyException` を通して送信者に伝搬されます。

source: if a reply handler is set, then the failure is propagated back to the sender via an `io.vertx.core.eventbus.ReplyException` with code `ConsumeEvent#FAILURE_CODE` and the exception message,
ja_jp: 返信ハンドラが設定されている場合、失敗はコード `ConsumeEvent#FAILURE_CODE` と例外メッセージを含む `io.vertx.core.eventbus.ReplyException` を通じて送信者に伝えられます。

source: if a valid Kube config file is found, in which case that configuration will be used by the client. It is, however, possible to force the dev service to start anyway by setting `quarkus.kubernetes-client.devservices.override-kubeconfig` to `true` to disregard the existing configuration
ja_jp: 有効な Kube config ファイルが見つかり、その設定がクライアントによって使用される場合。ただし、既存の設定を無視するために `quarkus.kubernetes-client.devservices.override-kubeconfig` を `true` に設定することで、dev service を強制的に起動させることも可能です。

source: if no reply handler is set then the exception is rethrown (and wrapped in a `RuntimeException` if necessary) and can be handled by the default exception handler, i.e. `io.vertx.core.Vertx#exceptionHandler()`.
ja_jp: 返答ハンドラーが設定されていない場合、例外は必要に応じて `RuntimeException` でラップされて再スローされ、デフォルトの例外ハンドラー、すなわち `io.vertx.core.Vertx#exceptionHandler()` で処理されます。

source: if no reply handler is set, then the exception is rethrown (and wrapped in a `RuntimeException` if necessary) and can be handled by the default exception handler, _i.e._ `io.vertx.core.Vertx#exceptionHandler()`.
ja_jp: リプライ・ハンドラが設定されていない場合、例外は再スローされ（必要であれば `RuntimeException` でラップされる）、デフォルトの例外ハンドラ、 _すなわち_ `io.vertx.core.Vertx#exceptionHandler()` で処理されます。

source: if no reply handler is set, then the exception is rethrown (and wrapped in a `RuntimeException` if necessary) and can be handled by the default exception handler, i.e. `io.vertx.core.Vertx#exceptionHandler()`.
ja_jp: 応答ハンドラが設定されていない場合、例外は再スローされ（必要に応じて `RuntimeException` でラップされる）、デフォルトの例外ハンドラ、すなわち `io.vertx.core.Vertx#exceptionHandler()` で処理することができます。

source: if none of the above steps located a configuration file, the default <<registry.quarkus.io.maven.repo,registry.quarkus.io>> configuration will be used.
ja_jp: 上記のいずれの手順でも設定ファイルが見つからない場合は、デフォルトの <<registry.quarkus.io.maven.repo,registry.quarkus.io>> 設定が使用されます。

source: if none of the above steps located a configuration file, the default xref:registry.quarkus.io.maven.repo[registry.quarkus.io] configuration will be used.
ja_jp: 上記の手順のいずれでも設定ファイルが見つからない場合、デフォルトの xref:registry.quarkus.io.maven.repo[registry.quarkus.io] の設定が使用されます。

source: if not set, the connector looks for a `Map` with the channel name or the configured `kafka-configuration` (if set) and the value is retrieved from that `Map`
ja_jp: 設定されていない場合、コネクターはチャネル名または設定された `kafka-configuration` (設定されている場合) を含む `Map` を検索し、その `Map` から値を取得します。

source: if set to true, the access will be denied to all CDI methods and JAX-RS endpoints that do not have security annotations but are defined in classes that contain methods with security annotations. Defaults to `false`.
ja_jp: この値をtrue に設定すると、セキュリティアノテーションを持つメソッドを含むクラスで定義されているものの、セキュリティアノテーションを持たないすべての CDI メソッドと JAX-RS エンドポイントへのアクセスが拒否されるようになります。デフォルトは `false` です。

source: if the client is explicitly configured to access a given API server via `quarkus.kubernetes-client.api-server-url`
ja_jp: クライアントが `quarkus.kubernetes-client.api-server-url` を介して特定の API サーバーにアクセスするように明示的に設定されている場合

source: if the dev service is explicitly disabled by setting `quarkus.kubernetes-client.devservices.enabled` to `false`
ja_jp: dev service が `quarkus.kubernetes-client.devservices.enabled` を `false` に設定することで明示的に無効になっている場合

source: if the issued at ('iat') claim is required
ja_jp: 発行時刻 ('iat') クレームが必須かどうか

source: if the subject ('sub') claim is required
ja_jp: サブジェクト ('sub') クレームが必須かどうか

source: if you do not enable the management interface, these endpoints will be served using the main HTTP server (under `/q` by default).
ja_jp: マネジメントインタフェースを有効にしない場合、これらのエンドポイントは、メインのHTTPサーバー (デフォルトでは `/q` 以下) を使用して提供されます。

source: if you do not return the `Uni` or `Multi` in a method invoked by Quarkus, you should subscribe to it:
ja_jp: Quarkus によって呼び出されるメソッドで `Uni` または `Multi` を返さない場合は、それをサブスクライブする必要があります。

source: if you include the `quarkus-test-kubernetes-client` dependency as, presumably, in that case, you have tests that rely on the Fabric8 mock server and don't need to start a cluster
ja_jp: `quarkus-test-kubernetes-client` 依存関係を含める場合。おそらくそのケースでは、Fabric8 モックサーバーに依存するテストがあり、クラスターを起動する必要がないためです。

source: if you return the `Uni` or `Multi` in a method invoked by Quarkus (like with Quarkus REST, Quarkus WebSocket Next or Quarkus Messaging), Quarkus subscribes to it and processes the items emitted by the `Multi` or the item emitted by the `Uni`:
ja_jp: Quarkus によって呼び出されるメソッド (Quarkus REST、Quarkus WebSocket Next、Quarkus Messaging など) で `Uni` または `Multi` を返すと、Quarkus はそれをサブスクライブし、 `Multi` によって発行された項目または `Uni` によって発行された項目を処理します。

source: if you see `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` or similar SSL error, due to the current status of GraalVM, there is some additional work to bundle the `function.zip`, as below. For more information, please see the xref:native-and-ssl.adoc[Quarkus Native SSL Guide].
ja_jp: もし、 `java.security.InvalidAlgorithmParameterException: the trustAnchors parameter must be non-empty` 、または同様のSSLエラーが表示された場合、GraalVMの現状のため、 `function.zip` 、以下のようにバンドルするための追加作業があります。詳しくは、xref:native-and-ssl.adoc[Quarkus Native SSL ガイド] をご覧ください。

source: if you use `redirect` or `disabled` and have not added a SSL certificate or keystore, your server will not start!
ja_jp: `redirect` または `disabled` を使用していて、SSL 証明書またはキーストアを追加していない場合は、サーバーが起動しません。

source: if you use `redirect` or `disabled` and have not added an SSL certificate or keystore, your server will not start!
ja_jp: `redirect` または `disabled` を使用していて、SSL 証明書またはキーストアを追加していない場合は、サーバーは起動しません。

source: ignore (default if `enabled.auto.commit=true` is set)
ja_jp: 無視 ( `enabled.auto.commit=true` が設定されている場合のデフォルト)

source: illustrate how you add dependencies to this script. This is a feature of JBang.
ja_jp: このスクリプトに依存関係を追加する方法を示しています。これは `jbang` の機能です。

source: image: This will display an image
ja_jp: image: これにより画像が表示されます

source: image:containerization-process.png[Containerization Process]
ja_jp: image:containerization-process.png[alt="Containerization Process"]

source: image:kogito-guide-screenshot.png[alt=Process definition]
ja_jp: image:kogito-guide-screenshot.png[alt=プロセス定義]

source: image:native-executable-process.png[Creating a native executable]
ja_jp: image:native-executable-process.png[ネイティブ実行可能ファイルの生成]

source: image:qute-completion-snippets.gif[Qute snippet completion]
ja_jp: image:qute-completion-snippets.gif[alt="Qute snippet completion"]

source: image:registry-nexus3-repository.png[Nexus Repository Proxy]
ja_jp: image:registry-nexus3-repository.png[alt=Nexus Repository Proxy]

source: import all values from a Secret or ConfigMap
ja_jp: Secret または ConfigMap からすべての値をインポート

source: import observeState from the LitState library.
ja_jp: LitState ライブラリーから observeState をインポートします。

source: import the project in your favorite IDE
ja_jp: よく利用する IDE でプロジェクトをインポートする

source: import the state you are interested in, in this case assistant state.
ja_jp: 関心のある状態 (この場合はアシスタントの状態) をインポートします。

source: import the state you are interested in, in this case connection state.
ja_jp: 関心のある状態 (この場合は接続状態) をインポートします。

source: import the state you are interested in, in this case theme state.
ja_jp: 関心のある状態 (この場合はテーマ状態) をインポートします。

source: imports a chosen version of `io.quarkus:quarkus-bom` (the platform BOM may be flattened at the end but it has to be based on some version of `io.quarkus:quarkus-bom`)
ja_jp: `io.quarkus:quarkus-bom` の選択されたバージョンをインポートすること (プラットフォームの BOM は最後にフラット化されますが、 `io.quarkus:quarkus-bom` の何らかのバージョンに基づいていなければなりません)

source: imports a chosen version of `io.quarkus:quarkus-bom` (the platform BOM may be flattened at the end, but it has to be based on some version of `io.quarkus:quarkus-bom`)
ja_jp: `io.quarkus:quarkus-bom` の選択されたバージョンをインポートすること (プラットフォームの BOM は最後にフラット化されますが、 `io.quarkus:quarkus-bom` の何らかのバージョンに基づいていなければなりません)

source: in <<persistence-xml,`persistence.xml`>> through the `<mapping-file>` element.
ja_jp: <<persistence-xml,`persistence.xml`>> で `<mapping-file>` 要素を使用して追加する方法。

source: in `application.properties` through the (build-time) link:#quarkus-hibernate-orm_quarkus-hibernate-orm-mapping-files[`quarkus.hibernate-orm.mapping-files`] property.
ja_jp: `application.properties` で (ビルド時に) link:#quarkus-hibernate-orm_quarkus-hibernate-orm-mapping-files[`quarkus.hibernate-orm.mapping-files`] プロパティーを使用して追加する方法。

source: in `application.properties` through the (build-time) link:#quarkus-hibernate-orm_quarkus.hibernate-orm.mapping-files[`quarkus.hibernate-orm.mapping-files`] property.
ja_jp: `application.properties` で（ビルド時の） link:#quarkus-hibernate-orm_quarkus.hibernate-orm.mapping-files[`quarkus.hibernate-orm.mapping-files`]プロパティを使用して。

source: in case multiple Avro serdes are present, serializer/deserializer must be configured manually for Avro-generated classes, because autodetection is impossible
ja_jp: 複数の Avro serde が存在する場合、自動検出は使用できないため、Avro が生成するクラスに対してシリアライザー/デシリアライザーを手動で設定する必要があります

source: in native mode only external coordinators (i.e. not embedded with the application) are supported (we will provide a coordinator extension in a later release to address this deficiency).
ja_jp: ネイティブモードでは、外部のコーディネーター（アプリケーションに組み込まれていないもの）しかサポートされていません（この欠点を解決するために、後のリリースでコーディネーターのエクステンションを提供する予定です）。

source: in order to customize the exception handling of certain Resource Classes.
ja_jp: 特定のリソースクラスの例外処理をカスタマイズする為です。

source: in order to ensure that various resources are included and additional reflection is registered.
ja_jp: さまざまなリソースが含まれており、追加のリフレクションが登録されていることを確認するため。

source: in other cases it will use the 'Standalone' extension layout and defaults.
ja_jp: それ以外の場合は 'Standalone' エクステンションのレイアウトとデフォルトを使用します。

source: in the `application.properties` file.
ja_jp: `application.properties` ファイルは以下のとおりです。

source: in the `gdb` prompt.
ja_jp: `gdb` プロンプトで実行することで読み込まれます。

source: in the context of an application, you will rely on configuring the `native-image` configuration by tweaking your `pom.xml`;
ja_jp: アプリケーションの文脈では、`pom.xml` を修正して、 `native-image` 設定を調整することに依存することになります。

source: in the context of an extension, Quarkus offers a lot of infrastructure to simplify all of this.
ja_jp: エクステンションの文脈では、Quarkus はこれらすべてを簡素化するための多くのインフラストラクチャーを提供しています。

source: in xref:persistence-xml[`persistence.xml`] through the `<mapping-file>` element.
ja_jp: xref:persistence-xml[persistence.xml] の `<mapping-file>` 要素経由。

source: include only enough information to complete the task. They delegate to other documentation types (concepts or reference) to provide additional context.
ja_jp: タスクを完了するための十分な情報のみ含まれます。追加のコンテクストの提供については、他のタプのドキュメント (コンセプトやリファレンス) に委ねます。

source: include specific examples to illustrate the explanation, but avoid making the explanation itself overly dependent on a specific technology or pattern of implementation.
ja_jp: 説明を明確にする具体的な例が含まれます。ただし、特定のテクノロジーや実装パターンに過度に依存する説明は避けます。

source: includes all the Quarkus extension artifacts (the runtime and the deployment ones) the platform consists of
ja_jp: プラットフォームを構成するすべてのQuarkusエクステンションアーティファクト（ランタイムとデプロイメントのもの）を含むこと

source: includes all the necessary third-party artifacts that align the transitive dependency versions of the platform extensions to guarantee compatibility between them
ja_jp: プラットフォームエクステンション間の互換性を保証するために、遷移的な依存関係のバージョンを整列させるために必要なすべてのサードパーティ製アーティファクトが含まれていること

source: includes the <<platform-descriptor,platform JSON descriptor>> artifact
ja_jp: link:#platform-descriptor[プラットフォームJSONディスクリプタ]アーティファクトを含むこと

source: includes the xref:platform-descriptor[platform JSON descriptor] artifact
ja_jp: xref:platform-descriptor[プラットフォームJSONディスクリプター] アーティファクトを含むこと

source: increases the startup RSS usage of the application
ja_jp: アプリケーションの起動時のRSS使用量が増加します。

source: increases your build time, mainly if you use high-compression levels
ja_jp: 主に高圧縮レベルを使用した場合、ビルド時間が長くなります。

source: index.html and web extension codestarts
ja_jp: index.htmlとWebエクステンションの Codestart

source: infinispan, datagrid
ja_jp: infinispan, データグリッド

source: infix notation that can be used for virtual methods with single parameter, translated to `name.or('John')`; no namespace, two parts - `name`, `or('John')`
ja_jp: `name.or('John')` に翻訳される、単一のパラメーターを持つ仮想メソッドに使用できる 中置 (infix) 記法。名前空間なし、2 つのパーツ - `name` . `or('John')`

source: initialize the client in a `static` block, which, thanks to class preloading will be executed before the snapshot
ja_jp: `static` ブロックでクライアントを初期化します。これは、クラスのプリロードのおかげで、スナップショットの前に実行されることになります。

source: inside the `create` method, `user` would only contain the value of `name` while `id` would always be `null` (regardless if the JSON request contained it)
ja_jp: `create` メソッドの内部では、 `user` は `name` の値のみを含み、 `id` は常に `null` になります（JSON リクエストにそれが含まれているかどうかに関係なく）。

source: integrates with the reactive engine from Quarkus as well as the reactive development model
ja_jp: Quarkusのリアクティブエンジンやリアクティブ開発モデルと統合されています

source: integration with the Envers extension is not supported
ja_jp: Enversエクステンションとの統合はサポートされていません。

source: internal ID token lifespan
ja_jp: 内部 ID トークンの有効期間

source: interpolate a single value identified by a given field in a Secret or ConfigMap
ja_jp: Secret または ConfigMap の指定されたフィールドで識別される単一の値を補間

source: interpolate a value from a field within the same resource
ja_jp: 同じリソース内のフィールドから値を補間

source: is <<eliminate_false_positives,excluded from removal>>, or
ja_jp: <<eliminate_false_positives,excluded from removal>>、または

source: is excluded from removal by an extension, or
ja_jp: エクステンションによる削除から除外されている、または

source: is no longer required.
ja_jp: これはもう必要ありません。

source: is not _unremovable_, and
ja_jp: _削除不可_ ではない、および

source: is not eligible for injection into any <<injecting-multiple-bean-instances-intuitively,`@Inject @All List<>`>> injection point.
ja_jp: <<injecting-multiple-bean-instances-intuitively,`@Inject @All List<>`>> 注入ポイントに注入する資格がない。

source: is not eligible for injection into any `jakarta.enterprise.inject.Instance` or `jakarta.inject.Provider` injection point, and
ja_jp: `jakarta.enterprise.inject.Instance` または `jakarta.inject.Provider` 注入ポイントへの注入には適格ではない。

source: is not eligible for injection into any `javax.enterprise.inject.Instance` or `javax.inject.Provider` injection point.
ja_jp: `javax.enterprise.inject.Instance` または `javax.inject.Provider` の注入ポイントに注入することが出来ないこと

source: is not eligible for injection to any injection point in the dependency tree of _unremovable_ beans, and
ja_jp: _削除不可能_ な Bean の依存ツリー内のどの注入ポイントにも注入できない。

source: is not eligible for injection to any injection point in the dependency tree, and
ja_jp: 依存関係ツリーの挿入ポイントへの挿入に適格ではなく、

source: is not unremovable, and
ja_jp: 削除不可能ではないこと

source: isHttps is false as https is not used
ja_jp: isHttps は https を使用しないので false です。

source: it is not possible to set `HostnameVerifier` or `SSLContext`
ja_jp: `HostnameVerifier` または `SSLContext` を設定することができません

source: it is not possible to set `SSLContext`
ja_jp: `SSLContext` を設定することはできません。

source: it is technically not needed to subclass `JsonbSerializer`, but in such case, autodetection isn't possible
ja_jp: 技術的には `JsonbSerializer` をサブクラスにする必要はありませんが、その場合は自動検出ができません

source: it is technically not needed to subclass `ObjectMapperSerializer`, but in such case, autodetection isn't possible
ja_jp: 技術的には `ObjectMapperSerializer` をサブクラスにする必要はありませんが、その場合は自動検出ができません

source: it must be explicitly declared as "caching relevant":
ja_jp: この場合、"caching relevant" として明示的に宣言する必要があります。

source: it takes some time before the JIT kicks in and fully optimizes the code.
ja_jp: JITが作動してコードを完全に最適化するまでに時間がかかります。

source: it's not configurable via a `persistence.xml` file
ja_jp: `persistence.xml` のファイルでは設定できません。

source: it's not possible to configure multiple persistence units at the moment
ja_jp: 現時点では、複数の永続化ユニットを設定することはできません。

source: it’s worth compiling that code path, i.e. it’s being executed enough times, and that
ja_jp: そのコードパスをコンパイルする価値があります。つまり、十分な回数実行されています。

source: ja.quarkus.io is now public
ja_jp: ja.quarkus.ioが公開されました

source: jar resource (`jar:`)
ja_jp: jar リソース (`jar:`)

source: jbang Integration
ja_jp: jbangの統合

source: jbang dev mode & platform support
ja_jp: jbangの開発モードとプラットフォームのサポート

source: jbang integration for easy Quarkus-based scripting
ja_jp: jbangを統合して簡単にQuarkusベースのスクリプティングを実現

source: jdbc-realm
ja_jp: JDBC レルム

source: jpa
ja_jp: ジェーピーエー

source: json - `.json()` (requires the https://redis.com/modules/redis-json/[RedisJSON] module on the server side)
ja_jp: json - `.json()` (サーバー側に link:https://redis.com/modules/redis-json/[RedisJSON] モジュールが必要)

source: key/value pairs
ja_jp: キー/値のペア

source: keywords that can be used to find the extension in the extension catalog
ja_jp: エクステンションカタログでエクステンションを検索するために使用できるキーワード

source: labels and
ja_jp: ラベルおよび

source: language: The coding language (e.g. Java, Kotlin, Scala)
ja_jp: language: コーディング言語（例：Java、Kotlin、Scala）

source: languages
ja_jp: 言語

source: latest (default before Quarkus 1.10)
ja_jp: 最新版(Quarkus 1.10未満のデフォルト)

source: layout: feature title: Versatility subtitle: permalink: /versatility/ intro: The client-server architecture has been the de-facto standard for building applications for years. But a significant shift happened. The <em>one model rules them all</em> age is over. A new range of applications and architectural styles have emerged and transformed how code is written and how applications are deployed and executed. HTTP microservices, reactive applications, event-driven architecture, function as a service, and AI-infused applications are now central players in modern systems. icon-light: assets/images/about/icon-versatility.svg icon-dark: assets/images/about/icon-versatility-dark.svg ---
ja_jp: layout: feature title: 多用途性 subtitle: permalink: /versatility/ intro: クライアント サーバー アーキテクチャは、長年にわたりアプリケーション構築のデファクト スタンダードでした。しかし、大きな変化が起こりました。<em>1 つのモデルがすべてを支配する</em>時代は終わりました。新しいアプリケーションとアーキテクチャ スタイルが登場し、コードの記述方法やアプリケーションの展開および実行方法が変わりました。HTTP マイクロサービス、リアクティブ アプリケーション、イベント駆動型アーキテクチャ、サービスとしての機能、AI を組み込んだアプリケーションが、現代のシステムで中心的な役割を果たしています。 icon-light: assets/images/about/icon-versatility.svg icon-dark: assets/images/about/icon-versatility-dark.svg ---

source: leave it to Dev Services to pick-up various Dev Resources from classpath, and apply xref:dev-services.adoc[Dev Service] concept to it
ja_jp: Dev Services に、クラスパスからさまざまな Dev Resource を取得させ、xref:dev-services.adoc[Dev Service] の概念をそれに適用する

source: less than 15 minutes
ja_jp: 15 分弱

source: less than 20 minutes
ja_jp: 20分弱

source: lifecycle event
ja_jp: ライフサイクルイベント

source: limits the extension catalog provided by `registry.acme.org` to the extensions that make up the `acme-cloud` offering.
ja_jp: `registry.acme.org` によって提供されるエクステンションカタログを、`acme-cloud` オファリングを構成するエクステンションに制限します。

source: link to the extension's guide or documentation
ja_jp: エクステンションのガイドまたはドキュメントへのリンク

source: link:/blog/path-resolution-in-quarkus/[Path resolution] for configurable endpoints changed in this release.
ja_jp: このリリースでは、設定可能なエンドポイントの link:/blog/path-resolution-in-quarkus/[パス解決]が変更されました。

source: link:/blog/quarkus-2-0-0-alpha1-released/[2.0.0.Alpha1 announcement]
ja_jp: link:/blog/quarkus-2-0-0-alpha1-released/[2.0.0.Alpha1アナウンス]

source: link:/blog/quarkus-2-0-0-alpha2-released/[2.0.0.Alpha2 announcement]
ja_jp: link:/blog/quarkus-2-0-0-alpha2-released/[2.0.0.Alpha2アナウンス]
